# ***  Словари (Dictionary)***

#Создание словаря
my_dict = {1:100, 2:200, "a" : "hello", "abc":(10,20,30)}
print(my_dict)

#Чтение данных
# item_ my_dict[1]
item = my_dict["abc"]

#изменение значения пары
my_dict["a"] =3.14

#Удаление элемента (пары)
#del my_dict["a"]

#Добавление нового элемента
my_dict["key"] = True


# ***проблема со чтением значения**

#val = my_dict["key_2"]

k = "key_2"

# Первый вариант решения проблемы
#if k in my_dict:
#    val = my_dict[k]
#else:
#    val = "Такого ключа не существует"

#второй вариант решения проблемы
#val = my_dict.get(k) # Возвращает по умолчанию значение none
val = my_dict.get(k, "hello") #Возвращает пользовательское значение X


# *** Проблема при удалении несуществующего ключа ***

k2 = "key_2"

#del my_dict[k2]

#второй вариант решения проблемы

val = my_dict.pop(k2, None)

# *** Копирование ***

d_1 = {"A":100, "B":200, "C":300}

d_2 = d_1

d_2["A"] = 10

d_2 = d_1.copy()

d_2["A"] = 10


# *** Обновление данных ***

#Обновление существующего значения
d_3 ={"B":777}

#d_1.update(d_3)

#Обновление существующего значения и добавление нового элемента
d_4 ={"B":777, "D":1000}

d_1.update(d_4)
print(d_1)